app/controllers/api/v1/users_controller.rb

  def show
    begin
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('damien.kuvalis@mcdermott.info', '$2a$04$GkaQW8Pcdauuxlx/KfHkZ.hLMrGqh3jmzGzlEK.1gNCUYhodJeGMW', '2017-07-20 01:49:17', '2017-07-20 01:49:17')

  def update
      user = User.find(params[:id])
      if user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `email` = 'new_email_malaca@gmail.com.br', `updated_at` = '2017-07-25 00:26:23' WHERE `users`.`id` = 1

  def destroy
    user = User.find(params[:id])
    # user.destroy
    if user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1